Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetUnscaledTransform(Autodesk.Revit.DB.IFC.ExporterIFC,Autodesk.Revit.DB.IFC.IFCAnyHandle)
Obtains the unscaled transform from an IfcLocalPlacement handle.
exporterIFC:
The exporter.
placement:
The placement handle.
Returns:
The transform.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFCUtils.SortCurveLoops(System.Collections.Generic.IList`1{Autodesk.Revit.DB.CurveLoop})
Sorts a set of curve loops such that outer and inner loops are separated.
Remarks:
Outer loops are separated and inner loops are grouped according to their outer loop. Loops are assumed to be non-intersecting,
and there will be no nesting of inner loops (that is, an inner loop of an inner loop is another outer loop).
loops:
The curve loops.
Returns:
The sorted collection of loops.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetNumBuildingStoreys(Autodesk.Revit.DB.IFC.ExporterIFC)
Returns the number of non-empty, non-duplicate building stories in the file.
exporterIFC:
The exporter.
Returns:
The number of stories.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013